#+TITLE: Python 3 porting - quickstart
#+OPTIONS: ^:{}, num:nil

在 [[http://wiki.in.zhihu.com/pages/viewpage.action?pageId=38832334][Python 3 porting 大纲]] 中，我们简单的描述了 porting 的几个基本步骤：

1. 提高项目测试覆盖率，推荐超过 80%
2. 学习 Python 2 和 Python 3 之间的差异
3. 检测项目依赖是否 2&3 兼容
4. 修改代码，让其兼容 Python 3
5. 让测试在 Python 2 和 Python 3 两个环境下进行

在这篇文档中，我们会对每个步骤的细节进行适当分析，给出简单示例。
并会对很容易陷入的坑进行提示。

*** unicode、str 和 bytes

下面我们通过代码来看一些典型的栗子：

#+BEGIN_SRC python2 :exports both
# -*- coding: utf-8 -*-

### no bytes in py2, str is bytes
##  unicode.encode -> bytes
##  str.decode -> unicode
##  str.encode -> str.decode('ascii').encode('ascii')

a = 'aha'   # str, py2 do not have bytes
b = b'aha'  # str, ignore in py2
c = u'aha'  # unicode
print a == b == c

### implicit unicode convension (awesome or wtf

'haha'.encode('utf-8')  # => 'haha'.decode('utf-8', 'ascii').encode('utf-8')
try:
    '哈哈'.encode('utf-8')
except UnicodeDecodeError:
    u'哈哈'.encode('utf-8')
print '呵呵' == u'呵呵'  # False, converting failed.
print 'aha' == u'aha'  # True, converting success.

### bytes format
print('miao, {}'.format(b'aha'))

#+END_SRC

#+RESULTS:
: True
: False
: True
: miao, aha

#+begin_src python3 :exports both

### str is unicode (maybe
a = 'aha'   # str
b = b'aha'  # bytes
c = u'aha'  # unicode
print(a == b, a == c, b == c, u'哈哈' == '哈哈')

### bytes format
print(b'aha', 'miao, {}'.format(b'aha'))

#+end_src

#+RESULTS:
: False True False True
: b'aha' miao, b'aha'


1. 简单理解：Python 2 中，str 是 bytes；Python 3 中，str 是 unicode
2. Python 2 在很多场景会隐式将 str 转换成 unicode
3. 迁移相关代码时， *最重要的就是知道你的函数接收什么类型，返回什么类型*
3. 如果出现奇怪错误，检查系统的 locale 是否为 \*.UTF-8

顺手推荐一篇关于 python unicode 的经典文章：[[https://nedbatchelder.com/text/unipain.html]]
（就和这个讲协程的 [[y][视频]] 一样经典

